/******************************************************************************
 * 文件名称 : user_main.c
 * 用途：  主程序入口
 * 作者   : 小白
 * 时间    : 2017-1-18
*******************************************************************************/
#include "esp_common.h"
#include "user_config.h"

/******************************************************************************
 * 函数名      : user_init
 * 函数作用  : entry of user application, init user function here
 * 参数          : none
 * 返回值      : none
*******************************************************************************/
void user_init(void)
{	
	//打印软件版本号
	os_printf("software version:%s\n", SOFTWARE_VERSION);
}
